In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(':memory:')

In [3]:
table_names = [
    'Categories',   # –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ —Ç–æ–≤–∞—Ä–æ–≤
    'Customers',    # –∑–∞–∫–∞–∑—á–∏–∫–∏
    'Employees',    # —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–∏
    'OrderDetails', # –¥–µ—Ç–∞–ª–∏ –∑–∞–∫–∞–∑–æ–≤
    'Orders',       # –∑–∞–∫–∞–∑—ã
    'Products',     # —Ç–æ–≤–∞—Ä—ã
    'Shippers',     # –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∏
    'Suppliers',    # –ø–æ—Å—Ç–∞–≤—â–∏–∫–∏
]

In [4]:
for table in table_names:
    data = pd.read_csv(f'{table}.csv', sep = ';')
    data.to_sql(table, con, index=False, if_exists='replace')

In [5]:
pd.read_sql(
    '''
    SELECT * FROM Categories
    ''',
    con,
)

,CategoryID,CategoryName,Description
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales"
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an..."
2,3,Confections,"Desserts, candies, and sweet breads"
3,4,Dairy Products,Cheeses
4,5,Grains/Cereals,"Breads, crackers, pasta, and cereal"
5,6,Meat/Poultry,Prepared meats
6,7,Produce,Dried fruit and bean curd
7,8,Seafood,Seaweed and fish

In [6]:
tasks = 0

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

1. –í—ã–±–µ—Ä–∏—Ç–µ –∑–∞–∫–∞–∑—á–∏–∫–æ–≤ –∏–∑ –ì–µ—Ä–º–∞–Ω–∏–∏, –§—Ä–∞–Ω—Ü–∏–∏ –∏ –ú–∞–¥—Ä–∏–¥–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏–µ, —Å—Ç—Ä–∞–Ω—É –∏ –∞–¥—Ä–µ—Å.

In [13]:
tasks+=1
pd.read_sql(
    '''
    SELECT CustomerName, Country, Address FROM Customers
    where Country in ('Germany', 'France' ) or city ='Madrid'
    order by 2,1
    ''',
    con,
)

,CustomerName,Country,Address
0,Blondel p√®re et fils,France,"24, place Kl√©ber"
1,Bon app',France,"12, rue des Bouchers"
2,Du monde entier,France,"67, rue des Cinquante Otages"
3,Folies gourmandes,France,"184, chauss√©e de Tournai"
4,France restauration,France,"54, rue Royale"
5,La corne d'abondance,France,"67, avenue de l'Europe"
6,La maison d'Asie,France,1 rue Alsace-Lorraine
7,Paris sp√©cialit√©s,France,"265, boulevard Charonne"
8,Sp√©cialit√©s du monde,France,"25, rue Lauriston"
9,Victuailles en stock,France,"2, rue du Commerce"
10,Vins et alcools Chevalier,France,59 rue de l'Abbaye
11,Alfreds Futterkiste,Germany,Obere Str. 57
12,Blauer See Delikatessen,Germany,Forsterstr. 57
13,Die Wandernde Kuh,Germany,Adenauerallee 900
14,Drachenblut Delikatessend,Germany,Walserweg 21
15,Frankenversand,Germany,Berliner Platz 43
16,K√∂niglich Essen,Germany,Maubelstr. 90
17,Lehmanns Marktstand,Germany,Magazinweg 7
18,Morgenstern Gesundkost,Germany,Heerstr. 22
19,Ottilies K√§seladen,Germany,Mehrheimerstr. 369
20,QUICK-Stop,Germany,Taucherstra√üe 10
21,Toms Spezialit√§ten,Germany,Luisenstr. 48
22,B√≥lido Comidas preparadas,Spain,"C/ Araquil, 67"
23,FISSA Fabrica Inter. Salchichas S.A.,Spain,"C/ Moralzarzal, 86"
24,Romero y tomillo,Spain,"Gran V√≠a, 1"

2. –í—ã–±–µ—Ä–∏—Ç–µ —Ç–æ–ø 3 —Å—Ç—Ä–∞–Ω—ã –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑—á–∏–∫–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–ø–∏—Å–µ–π.

In [29]:
tasks+=1
pd.read_sql("""
    SELECT * from (
        SELECT Country, count(*) 
        FROM Customers 
        GROUP BY 1
        ORDER BY 2 DESC)
    LIMIT 3
    """,
    con,
)

   Country  count(*)
0      USA        13
1  Germany        11
2   France        11

3. –í—ã–±–µ—Ä–∏—Ç–µ –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∞, –∫–æ—Ç–æ—Ä—ã–π –æ—Ç–ø—Ä–∞–≤–∏–ª 10-–π –ø–æ –≤—Ä–µ–º–µ–Ω–∏ –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ, –∏ –¥–∞—Ç—É –æ—Ç–ø—Ä–∞–≤–ª–µ–Ω–∏—è.

In [81]:
tasks+=1
pd.read_sql(
    ''' -- –Ω–µ –≤–∏–∂—É –≤ —Ç–∞–±–ª–∏—Ü–∞—Ö –¥–∞—Ç—ã –æ—Ç–ø—Ä–∞–≤–ª–µ–Ω–∏—è, –ø—É—Å—Ç—å –±—É–¥–µ—Ç –¥–∞—Ç–∞ –∑–∞–∫–∞–∑–∞
    select shippername, orderdate from (
    select *, row_number() over(order by date(OrderDate)) as ordernum from orders
    ) t 
    join shippers using(shipperid)
    where ordernum = 10
    ''',
    con,
).head(50)

        ShipperName   OrderDate
0  Federal Shipping  16.07.1996

4. –í—ã–±–µ—Ä–∏—Ç–µ —Å–∞–º—ã–π –¥–æ—Ä–æ–≥–æ–π –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ —Å–ø–∏—Å–æ–∫ —Ç–æ–≤–∞—Ä–æ–≤ —Å –∏—Ö —Ü–µ–Ω–∞–º–∏.

In [107]:
tasks+=1
pd.read_sql(
    '''
    with maxorder as (
    select distinct orderid, max(orderprice) from (
        SELECT *
            , sum(price) over(partition by orderid) as orderprice 
        FROM orders 
        join orderdetails using(orderid) 
        join products using(productid)
    ) 
    )
    
    select price, productname 
    from maxorder join 
    orderdetails using(orderid) 
    join products using(productid)
    ''',
    con,
)

    Price              ProductName
0   45.60        R√∂ssle Sauerkraut
1  123.79  Th√ºringer Rostbratwurst
2  263.50            C√¥te de Blaye
3   20.00                 Maxilaku
4    7.45                Tourti√®re

5. –ö–∞–∫–æ–π —Ç–æ–≤–∞—Ä –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –µ–¥–∏–Ω–∏—Ü —Ç–æ–≤–∞—Ä–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –µ–¥–∏–Ω–∏—Ü –≤ –∫–∞–∂–¥–æ–º –∏–∑ –∑–∞–∫–∞–∑–æ–≤.

In [ ]:
table_names = [
    'Categories',   # –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ —Ç–æ–≤–∞—Ä–æ–≤
    'Customers',    # –∑–∞–∫–∞–∑—á–∏–∫–∏
    'Employees',    # —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–∏
    'OrderDetails', # –¥–µ—Ç–∞–ª–∏ –∑–∞–∫–∞–∑–æ–≤
    'Orders',       # –∑–∞–∫–∞–∑—ã
    'Products',     # —Ç–æ–≤–∞—Ä—ã
    'Shippers',     # –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∏
    'Suppliers',    # –ø–æ—Å—Ç–∞–≤—â–∏–∫–∏
]

In [131]:
tasks+=1
pd.read_sql(
    '''
    with productids as ( 
    SELECT productid, count(*) FROM 
    orders 
    join orderdetails using(orderid)
    join products using (productid)
    group by productid
    order by 2 desc
    limit 1) --select * from productids
    
    select  productname, orderid, count(*) as cnt from 
    products
    join orderdetails using(productid) 
    join orders using(orderid)
    where productid in (select productid from productids)
    group by 1,2
    ''',
    con,
)

               ProductName  OrderID  cnt
0   Mozzarella di Giovanni    10248    1
1   Mozzarella di Giovanni    10268    1
2   Mozzarella di Giovanni    10269    1
3   Mozzarella di Giovanni    10272    1
4   Mozzarella di Giovanni    10274    1
5   Mozzarella di Giovanni    10283    1
6   Mozzarella di Giovanni    10297    1
7   Mozzarella di Giovanni    10325    1
8   Mozzarella di Giovanni    10330    1
9   Mozzarella di Giovanni    10337    1
10  Mozzarella di Giovanni    10372    1
11  Mozzarella di Giovanni    10390    1
12  Mozzarella di Giovanni    10396    1
13  Mozzarella di Giovanni    10435    1

6. –í—ã–≤–µ–¥–∏—Ç–µ —Ç–æ–ø 5 –ø–æ—Å—Ç–∞–≤—â–∏–∫–æ–≤ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è, —Å—Ç—Ä–∞–Ω—É, –∫–æ–Ω—Ç–∞–∫—Ç–Ω–æ–µ –ª–∏—Ü–æ –∏ —Ç–µ–ª–µ—Ñ–æ–Ω.

In [3]:
table_names = [
    'Categories',   # –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ —Ç–æ–≤–∞—Ä–æ–≤
    'Customers',    # –∑–∞–∫–∞–∑—á–∏–∫–∏
    'Employees',    # —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–∏
    'OrderDetails', # –¥–µ—Ç–∞–ª–∏ –∑–∞–∫–∞–∑–æ–≤
    'Orders',       # –∑–∞–∫–∞–∑—ã
    'Products',     # —Ç–æ–≤–∞—Ä—ã
    'Shippers',     # –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∏
    'Suppliers',    # –ø–æ—Å—Ç–∞–≤—â–∏–∫–∏
]

In [ ]:
—Å—Ç—Ä–∞–Ω—É, –∫–æ–Ω—Ç–∞–∫—Ç–Ω–æ–µ –ª–∏—Ü–æ –∏ —Ç–µ–ª–µ—Ñ–æ–Ω.

In [181]:
pd.read_sql("""
    select Suppliername, ContactName, Country, Phone from (
    select Suppliername, ContactName, Country, Phone,count(*)  from (
    select distinct suppliername, ContactName, Country, Phone, orderid
    from Suppliers 
    join products using(supplierid)
    join orderdetails using(productid)  
    ) group by 1,2,3,4
    order by 5 desc
    limit 5
    )
    """, con)

                        Suppliername   ContactName    Country           Phone
0                      Pavlova, Ltd.   Ian Devling  Australia   (03) 444-2343
1  Plutzer Lebensmittelgro√üm√§rkte AG   Martin Bein    Germany    (069) 992755
2           Specialty Biscuits, Ltd.  Peter Wilson         UK  (161) 555-4448
3                    Norske Meierier  Beate Vileid     Norway     (0)2-953010
4            Formaggi Fortini s.r.l.    Elio Rossi      Italy    (0544) 60323

7. –ö–∞–∫—É—é –∫–∞—Ç–µ–≥–æ—Ä–∏—é —Ç–æ–≤–∞—Ä–æ–≤ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –ø–æ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –≤ –ë—Ä–∞–∑–∏–ª–∏–∏, –≤—ã–≤–µ–¥–∏—Ç–µ —Å—Ç—Ä–∞–Ω—É, –Ω–∞–∑–≤–∞–Ω–∏–µ –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ –∏ —Å—É–º–º—É.

In [204]:
tasks+=1
pd.read_sql(
    '''
    SELECT country, categoryname, sum(price) 
    FROM Categories 
    join Products using(categoryid)
    join Orderdetails using(productid)
    join orders using(orderid)
    join Customers using(customerid)
    where country = 'Brazil'
    group by categoryname
    order by 3 desc
    limit 1
    ''',
    con,
)#['count(*)'].sum()

  Country CategoryName  sum(price)
0  Brazil    Beverages      405.75

8. –ö–∞–∫–∞—è —Ä–∞–∑–Ω–∏—Ü–∞ –≤ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –º–µ–∂–¥—É —Å–∞–º—ã–º –¥–æ—Ä–æ–≥–∏–º –∏ —Å–∞–º—ã–º –¥–µ—à–µ–≤—ã–º –∑–∞–∫–∞–∑–æ–º –∏–∑ –°–®–ê.

In [217]:
tasks+=1
pd.read_sql(
    '''
    select max(s) - min(s) as "—Ä–∞–∑–Ω–∏—Ü–∞ –≤ —Å—Ç–æ–∏–º–æ—Å—Ç–∏" from (
    SELECT *, sum(price) as s
    FROM Categories 
    join Products using(categoryid)
    join Orderdetails using(productid)
    join orders using(orderid)
    join Customers using(customerid)
    where country = 'USA'
    group by orderid)
    ''',
    con,
)#['count(*)'].sum()

   —Ä–∞–∑–Ω–∏—Ü–∞ –≤ —Å—Ç–æ–∏–º–æ—Å—Ç–∏
0               334.09

9. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–∫–∞–∑–æ–≤ —É –∫–∞–∂–¥–æ–≥–æ –∏—Ö —Ç—Ä–µ—Ö —Å–∞–º—ã—Ö –º–æ–ª–æ–¥—ã—Ö —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–æ–≤, –∞ —Ç–∞–∫–∂–µ –∏–º—è –∏ —Ñ–∞–º–∏–ª–∏—é –≤–æ –≤—Ç–æ—Ä–æ–π –∫–æ–ª–æ–Ω–∫–µ.

In [264]:
pd.read_sql(
    """
    select * from orders
    """,
    con,
)

     OrderID  CustomerID  EmployeeID   OrderDate  ShipperID
0      10248          90           5  04.07.1996          3
1      10249          81           6  05.07.1996          1
2      10250          34           4  08.07.1996          2
3      10251          84           3  08.07.1996          1
4      10252          76           4  09.07.1996          2
..       ...         ...         ...         ...        ...
191    10439          51           6  07.02.1997          3
192    10440          71           4  10.02.1997          2
193    10441          55           3  10.02.1997          2
194    10442          20           3  11.02.1997          2
195    10443          66           8  12.02.1997          1

[196 rows x 5 columns]

In [272]:
tasks+=1
pd.read_sql(
    """
    with e as (select * from (
    SELECT *, 
        --strftime('%d.%m.%Y',birthdate) as birthdate 
        -- suka ne rabotaet
        substring(birthdate, 7, 5) || '-' || substring(birthdate, 4, 2) || '-'  || substring(birthdate, 1, 2) as dt 
    FROM employees ) order by dt desc limit 3)
    
    select LastName || ' ' || FirstName as name, count(*) as "–∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–∫–∞–∑–æ–≤" 
    from e join orders using(EmployeeID) group by 1
    """,
    con,
)

              name  –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–∫–∞–∑–æ–≤
0    Davolio Nancy                  29
1   Dodsworth Anne                   6
2  Leverling Janet                  31

10. –°–∫–æ–ª—å–∫–æ –±–∞–Ω–æ–∫ –∫—Ä–∞–±–æ–≤–æ–≥–æ –º—è—Å–∞ –≤—Å–µ–≥–æ –±—ã–ª–æ –∑–∞–∫–∞–∑–∞–Ω–æ.

In [274]:
tasks+=1
pd.read_sql(
    '''
    SELECT * FROM Products where productname like '%crab%'
    ''',
    con,
)

   ProductID       ProductName  SupplierID  CategoryID            Unit  Price
0         40  Boston Crab Meat          19           8  24 - 4 oz tins   18.4

–ø—Ä–µ–¥–ø–æ–ª–æ–∂–∏–º —ç—Ç–æ —Ç–æ —á—Ç–æ –º—ã –∏—â–µ–º

In [279]:
tasks+=1
pd.read_sql(
    '''
    SELECT count(*) as '–∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –±–∞–Ω–æ–∫ –∫—Ä–∞–±–æ–≤–æ–≥–æ –º—è—Å–∞' FROM  orders join orderdetails using(orderid) where productid = 40
    ''',
    con,
)

   –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –±–∞–Ω–æ–∫ –∫—Ä–∞–±–æ–≤–æ–≥–æ –º—è—Å–∞
0                                8

In [3]:
table_names = [
    'Categories',   # –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ —Ç–æ–≤–∞—Ä–æ–≤
    'Customers',    # –∑–∞–∫–∞–∑—á–∏–∫–∏
    'Employees',    # —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–∏
    'OrderDetails', # –¥–µ—Ç–∞–ª–∏ –∑–∞–∫–∞–∑–æ–≤
    'Orders',       # –∑–∞–∫–∞–∑—ã
    'Products',     # —Ç–æ–≤–∞—Ä—ã
    'Shippers',     # –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∏
    'Suppliers',    # –ø–æ—Å—Ç–∞–≤—â–∏–∫–∏
]

In [281]:
tasks = 10

In [282]:
if tasks==10:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ